[
  {
    "id": "card_cpr",
    "title": "The Shield of CPR",
    "level": 1,
    "visualId": "icon_cpr_shield",
    "text": "When the King is attacked, remember CPR: Capture the attacker, Protect with a shield, or Run away. Look for the capture first."
  },
  {
    "id": "card_back_rank",
    "title": "The Back Rank Trap",
    "level": 1,
    "visualId": "icon_back_rank",
    "text": "When a King is trapped behind his own pawns, a rook on the eighth rank is checkmate. The pawns that protect him become his prison."
  },
  {
    "id": "card_stalemate",
    "title": "The Gift of Breath",
    "level": 1,
    "visualId": "icon_stalemate",
    "text": "When you are winning, leave your opponent one legal move. If he has no moves but is not in check, the game is a draw—stalemate."
  },
  {
    "id": "card_4",
    "title": "The Forked Road",
    "level": 2,
    "visualId": "icon_fork",
    "text": "A good move solves one problem. A great move creates two problems for your opponent at once. Knights and pawns are the masters of the fork."
  },
  {
    "id": "card_5",
    "title": "The Iron Nail",
    "level": 2,
    "visualId": "icon_pin",
    "text": "A pinned piece is not really a piece. It is a shield. Do not be romantic about it. Attack it again and again until the shield breaks."
  },
  {
    "id": "card_6",
    "title": "The Burning Line",
    "level": 2,
    "visualId": "icon_skewer",
    "text": "In a skewer, the King stands in front and the treasure hides behind. Set the line on fire; first the King runs, then the treasure dies."
  },
  {
    "id": "card_7",
    "title": "The Rule of the Square",
    "level": 3,
    "visualId": "icon_pawn_square",
    "text": "If your King can step inside the box from pawn to promotion, the pawn is dead. If he cannot, do not chase—race with your own pawn instead."
  },
  {
    "id": "card_8",
    "title": "The Iron Opposition",
    "level": 3,
    "visualId": "icon_opposition",
    "text": "In King endgames, the side who does not move often has the advantage. Stand in front of his King with one square between you and say: 'Your move, my friend.'"
  },
  {
    "id": "card_9",
    "title": "The Bodyguard King",
    "level": 3,
    "visualId": "icon_bodyguard",
    "text": "Your King is not a spectator. First he walks in front of the pawn, then the pawn walks to glory. If the pawn runs alone, both may die."
  }
]
